app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "jhfashjfakdjfdasljdaslkfd"], ["updated_at", "2016-05-13 19:05:25.902266"], ["id", 4]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :body))

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
---
  def destroy
    @post = Post.find(params[:id])